app/controllers/barbecues_controller.rb

  def index
    if current_user
      @barbecues = Barbecue.order(:date)
---
SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC

  def bbq_json
    bbq = Barbecue.find params[:id]
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 8]]